"""
Создать множество произвольного содержания. После каждой операции выводить множество на экран
Добавить 34 во множество.
Удалить 34 из множества
"""
set = {1, 2}
print(set)
set.add(34)
print(set)
set.remove(34)
print(set)