"""
Дана целочисленная квадратная матрица.
Найти в каждой строке наибольший элемент и поменять его местами с элементом главной диагонали.
"""
# arr = []
# for i in range(3):
#     column = []
#     for j in range(3):
#         column.append(int(input()))
#     arr.append(column)
#
# # output and find max
# max = arr[0][0]
# for i in range(len(arr)):
#     for j in range(len(arr[i])):
#         print(arr[i][j], " ", end='')
#         if arr[i][j] > max:
#             max = arr[i][j]
#     print()
# # replace
