"""
Дана длина ребра куба. Найти объем куба и площадь всей его поверхности.
"""
side = float(input())
print("V=", pow(side, 3))
print("S=", str(6 * pow(side, 2)))

