"""
Создать три переменные, содержащие возраст трех человек, найти сумму и вывести ее на экран.
Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран
"""
age_01 = 18
age_02 = 21
age_03 = 42
print(age_01, age_02, age_03)
age_summ = age_01 + age_02 + age_03
print(age_summ)
age_avg = age_summ / 3
print(age_avg)
