"""
Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
"""
a, b = float(input()), float(input())
print(a+b)
print(a-b)
print(a*b)
