# Определить переменные всех 4 базовых типов и вывести их на экран
a = 1
b = 2.1
c = "string of text"
d = True
print(a, b, c, d)
