"""
Создать два объекта класса Dog. Вывести их на экран
"""
from dog import Dog


def main():
    dog1 = Dog()
    dog2 = Dog()
    print(dog1, dog2)


if __name__ == "__main__":
    main()
