# Создать список произвольного содержания. Вывести на экран третий, пятый и шестой элементы
list = [11, 12, 13, 14, 15, 16]
print(list[2], list[4], list[5])
