"""
Выведите на экран n раз фразу "I am a programmer". Число n вводит пользователь.
"""
n = int(input("Enter n: "))
while n != 0:
    print("I am a programmer")
    n -= 1
