"""
Создать произвольную строку. Получить подстроку с начала и до седьмого элемента.
Написать два решения с использованием полной и сокращенной записи.
"""

s = "Производная строка"
print(s[0:7:1])
print(s[:7])
