"""
Написать произвольную строку.
Получить подстроку, которая начинается с пятого символа,
заканчивается предпредпоследним символом с шагом три.
"""
s = "Произвольная строка"
print(s[4:len(s) - 2:3])
