"""
Создать произвольную строку. Получить подстроку с нечетными элементами.
Написать два решения с использованием полной и сокращенной записи.
"""
s = "Произвольная строка"
print(s[0:len(s):2])
print(s[::2])
