"""
Ввести с клавиатуры имя пользователя.
Вывести на экран “Hello, [name]!”
"""
username = input()
print("Hello", username)
