"""
Создать произвольную строку. Получить подстроку с третьего элемента и до конца.
Написать два решения с использованием полной и сокращенной записи.
"""
s = "Произвольная строка"
print(s[2:len(s):1])
print(s[2:])
